000100200402          Dcl-Pr DayNumName Char(9);
000200200402           DayIn Packed(1);
000300181112          End-Pr;
000301200805
000302200805          Dcl-Pr MonthNumName Char(9);
000303200805           DayIn Packed(2);
000304200805          End-Pr;
000305200805
000400181112
