000100200616             PGM
000101200616             CALL       QGPL/STRJOB
000102200623             ADDLIBLE   BCI433LIB
000103200623             MONMSG     MSGID(CPF2103)
000104200616             DSPSYSLVL  OUTPUT(*DISPLAY)
000105200616             ENDPGM
000106200616
