000100200610        DCL-F INCOMETDSP WORKSTN;
000101200608        //This is a comment
000102200608         EXFMT GETINCOME;
000103200608
000104200608         DOW NOT(*IN03); //DOW *IN03 = *OFF
000105200608
000106200608         IF IncomeAmt = 0;
000107200608            *IN98 = *ON ;   // Zero Income Amount
000108200608            EXFMT GetIncome;
000109200608            *IN98 = *OFF;
000110200608            ITER;    // GO TO THE ENDDO FOR NEXT LOOP ITERATION
000111200608          	
000112200608        ELSEIF Married = ' ';
000113200608           *IN97 = *ON ;   // Blank married status
000114200608            EXFMT GetIncome;
000115200608            *IN97 = *OFF;
000116200608            ITER;    // GO TO THE ENDDO FOR NEXT LOOP ITERATION
000117200608
000118200608        ELSE;
000119200608               EXSR GetTaxRate;
000120200616
000121200616               IF STDEXPENSE > 4000;
000122200616                  STDEXPENSE = 4000;
000123200616               ENDIF;
000124200616               IF DONATIONS > 10000;
000125200616                  DONATIONS = 10000;
000126200616               ENDIF;
000127200616
000128200608
000129200608                 DEDUCTIONS = STDEXPENSE + DONATIONS;
000130200608
000131200608               AINCOMEAMT = (INCOMEAMT - DEDUCTIONS);
000132200608
000133200608        ENDIF;
000134200616        DAYSTOPAY = %Diff(d'2021-04-30': %Date(): *D);
000135200616
000136200616        EVAL TAXAMT = (AINCOMEAMT*TaxRate);
000137200616
000138200608
000139200608        // PROTECT FIRST SCREEN RECORD FIELDS
000140200608
000141200608        //REDISPLAY FIRST SCREEN RECORD AND THEN OVERLAY SECOND RECORD
000142200608
000143200608            *IN60 = *ON;
000144200608
000145200608 		    WRITE GETINCOME;
000146200608
000147200608             EXFMT YOURTAX;
000148200608
000149200608 		    *IN60 = '0';
000150200608
000151200608
000152200608            IF *IN03=*OFF;
000153200608                EXSR CLEAR;
000154200608                EXFMT GetIncome;
000155200608            ENDIF;
000156200608          ENDDO;
000157200608          *INLR = *ON;
000158200608          RETURN;
000159200608
000160200608
000161200608
000162200608        BEGSR GetTaxRate;
000163200616          IF   Married = 'N';
000164200616            SELECT;
000165200616              WHEN (IncomeAmt >= 500001);
000166200616                TaxRate =  .37;
000167200616              when (IncomeAmt >= 200001);
000168200616                TaxRate =  .35;
000169200616              when (IncomeAmt >= 157501);
000170200616                TaxRate =  .32;
000171200616              when (IncomeAmt >= 82501);
000172200616                TaxRate =  .24;
000173200616              when (IncomeAmt >= 38701);
000174200616                TaxRate =  .22;
000175200616              when (IncomeAmt >= 9526);
000176200616                TaxRate =  .12;
000177200616              other;
000178200616                TaxRate =  .10;
000179200616            ENDSL;
000180200616
000181200616
000182200616        ELSEIF Married = 'Y';
000183200616          SELECT;
000184200616              WHEN (IncomeAmt >= 600001);
000185200616                TaxRate =  .37;
000186200616              when (IncomeAmt >= 400001);
000187200616                TaxRate =  .35;
000188200616              when (IncomeAmt >= 315001);
000189200616                TaxRate =  .32;
000190200616              when (IncomeAmt >= 165001);
000191200616                TaxRate =  .24;
000192200616              when (IncomeAmt >= 77401);
000193200616                TaxRate =  .22;
000194200616              when (IncomeAmt >= 19051);
000195200616                TaxRate =  .12;
000196200616              other;
000197200616                TaxRate =  .10;
000199200616            ENDSL;
000200200616
000201200616         ENDIF;
000202200616
000203200616
000204200616
000205200608        ENDSR;
000206200616
000207200616
000214200616
000215200608
000216200608        BEGSR CLEAR;
000217200608
000218200610               TaxRate = 0;
000219200610               IncomeAmt = 0;
000220200610               Married = ' ';
000221200610               STDEXPENSE=0;
000222200610               DONATIONS=0;
000223200608
000224200608        ENDSR;
000225200608
