000001200707     A          R SHIFTWEEK                 PFILE(SENECAPAY/SHIFTWEEK)
000002200707     A          K EMPNUM
000003200707     A          S WORKSHIFT                 COMP(EQ '3')
000004200707
